In [1]:
import numpy
import pandas
import matplotlib.pyplot
import seaborn
from sklearn.model_selection import train_test_split

# 넘파이 ndarray 개요

In [2]:
import numpy as np

넘파이 array() : 다양한 인자를 입력받아서 ndarray로 변환  
ndarray.shape : ndarray의 크기, 행과 열의 수를 튜플로 갖는다.

In [3]:
#1차원 데이터
array1 = np.array([1,2,3])
print("array1 type :", type(array1))
#ndarray.shape는 ndarray의 차원과 크기를 튜플로 나타냄.
print("array1 array 형태 :", array1.shape)

array1 type : <class 'numpy.ndarray'>
array1 array 형태 : (3,)

In [4]:
#2차원 데이터
array2=np.array([[1,2,3],[2,3,4]])
print("array2 type:",type(array2))
print("array2 shape",array2.shape)
#array1과 다르게 로우와 칼럼으로 이뤄진 2차원 데이터
array3=np.array([[1,2,3]])
print("array3 type :",type(array3))
print("array3 shape :",array3.shape)

array2 type: <class 'numpy.ndarray'>
array2 shape (2, 3)
array3 type : <class 'numpy.ndarray'>
array3 shape : (1, 3)

ndarray.ndim : 배열의 차원 수를 갖는다.

In [5]:
print("array1 : {:0}차원, array2 : {:1}차원, array3 : {:2}차원".format(array1.ndim,array2.ndim,array3.ndim))

array1 : 1차원, array2 : 2차원, array3 :  2차원

# ndarray의 데이터 타입

ndarray 내의 데이터 값은 숫자, 문자열, 불 값 모두 가능  
단, ndarray 내의 데이터 타입은 동일한 데이터 타입만 가능

In [6]:
list1=[1,2,3]
print(type(list1))
array1=np.array(list1)
print(type(array1))
print(array1,array1.dtype)

<class 'list'>
<class 'numpy.ndarray'>
[1 2 3] int32

In [7]:
# 데이터 유형이 섞여 있는 리스트를 ndarray로 변경하면 데이터 크기가 더 큰 데이터 타입으로 형 변화
list2=[1,2,'test']
array2=np.array(list2)
print(array2,array2.dtype)

list3=[1,2,3.0]
array3=np.array(list3)
print(array3,array3.dtype)

['1' '2' 'test'] <U11
[1. 2. 3.] float64

In [8]:
# astype() : ndarray 내 데이터값의 타입 변경
array_int=np.array([1,2,3])
array_float=array_int.astype('float64')
print(array_float,array_float.dtype)

array_int1=array_float.astype('int32')
print(array_int1,array_int1.dtype)

array_float1=np.array([1.1,2.1,3.1])
array_int2=array_float1.astype("int32")
print(array_int2,array_int2.dtype)

[1. 2. 3.] float64
[1 2 3] int32
[1 2 3] int32

# ndarray 생성하기 - arange, zeros, ones

arange() : 0부터 (함수 인자 값-1)까지의 값을 순차적으로 ndarray의 데이터 값으로 변환  
zeros() : 튜플 형태의 shape 값을 입력하면 모든 값을 0으로 채운 해당 shape를 가진 ndarray를 반환  
ones() : 튜플 형태의 shape 값을 입력하면 모든 값을 1로 채운 shape를 가진 ndarray를 변환

In [9]:
sequence_array=np.arange(10)
print(sequence_array)
print(sequence_array.dtype,sequence_array.shape)

[0 1 2 3 4 5 6 7 8 9]
int32 (10,)

In [10]:
zero_array=np.zeros((3,2),dtype='int32')
print(zero_array)
print(zero_array.dtype,zero_array.shape)

one_array=np.ones((3,2))
print(one_array)
print(one_array.dtype,one_array.shape)

[[0 0]
 [0 0]
 [0 0]]
int32 (3, 2)
[[1. 1.]
 [1. 1.]
 [1. 1.]]
float64 (3, 2)

# reshape() : ndarray의 차원과 크기 변경

In [11]:
array1=np.arange(10)
print("array1:\n",array1)

array2=array1.reshape(2,5)
print("array2:\n",array2)

array3=array1.reshape(5,2)
print("array3:\n",array3)

array1:
 [0 1 2 3 4 5 6 7 8 9]
array2:
 [[0 1 2 3 4]
 [5 6 7 8 9]]
array3:
 [[0 1]
 [2 3]
 [4 5]
 [6 7]
 [8 9]]

In [12]:
#지정된 사이즈로 변경이 불가능하면 오류 발생
array1.reshape(4,3)

ValueError: cannot reshape array of size 10 into shape (4,3)

In [13]:
# -1 인자를 사용하면 원래의 ndarray와 호환되는 새로운 shape로 변환
array1=np.arange(10)
print(array1)
array2=array1.reshape(-1,5)
print("array2 shape:",array2.shape)
array3=array1.reshape(5,-1)
print("array3 shape:", array3.shape)

[0 1 2 3 4 5 6 7 8 9]
array2 shape: (2, 5)
array3 shape: (5, 2)

In [14]:
# -1을 사용하더라도 호환될 수 없는 형태는 변환 불가능
array1=np.arange(10)
array4=array1.reshape(-1,4)

ValueError: cannot reshape array of size 10 into shape (4)

reshape(-1,1) : 원본 ndarray가 2차원이고 여러 개의 로우를 가지되 반드시 1개의 칼럼을 가진 ndarray로 변환됨을 보장한다.

In [15]:
array1=np.arange(8)
array3d=array1.reshape((2,2,2))
#리스트로 변환해서 출력
print("array3d : \n", array3d.tolist())

#3차원 ndarray를 2차원 ndarray로 변환
array5=array3d.reshape(-1,1)
print("array5:\n", array5.tolist())
print("array5 shape:", array5.shape)

#1차원 ndarray를 2차원 ndarray로 변환
array6=array1.reshape(-1,1)
print("array6:\n", array6.tolist())
print("array6 shape:", array6.shape)

array3d :
 [[[0, 1], [2, 3]], [[4, 5], [6, 7]]]
array5:
 [[0], [1], [2], [3], [4], [5], [6], [7]]
array5 shape: (8, 1)
array6:
 [[0], [1], [2], [3], [4], [5], [6], [7]]
array6 shape: (8, 1)

# 넘파이의 ndarray의 데이터 세트 선택하기 - indexing
1. 특정 데이터만 추출 : 원하는 위치의 인덱스 값 지정
2. 슬라이싱 : 연속된 인덱스 상의 ndarray 추출
3. 팬시 인덱싱 : 일정한 인덱싱 집합을 지정해 해당 위치에 있는 데이터의 ndarray를 반환
4. 불린 인덱싱 : 불 값 인덱싱 집합을 기반으로 True에 해당하는 인덱스 위치에 있는 데이터 ndarray 반환

In [16]:
#단일 값 추출

#1부터 9까지의 1차원 ndarray 생성
array1=np.arange(start=1,stop=10)
print("array1 :", array1)
#index는 0부터 시작하므로 array1[2]는 3번째 index 위치의 데이터값을 의미
value=array1[2]
print("value :", value)
print(type(value))

array1 : [1 2 3 4 5 6 7 8 9]
value : 3
<class 'numpy.int32'>

In [17]:
print("맨 뒤의 값 :", array1[-1], "맨 뒤에서 두 번째 값 :", array1[-2])

맨 뒤의 값 : 9 맨 뒤에서 두 번째 값 : 8

In [18]:
# ndarray 내의 데이터값 수정
array1[0]=9
array1[8]=0
print("array1 :", array1)

array1 : [9 2 3 4 5 6 7 8 0]

In [19]:
# 다차원 ndarray에서 단일 값 추출
array1d=np.arange(start=1, stop=10)
array2d=array1d.reshape(3,3)
print(array2d)

print("(row=0, col=0) index 가리키는 값 :", array2d[0,0])
print("(row=0, col=1) index 가리키는 값 :", array2d[0,1])
print("(row=1, col=0) index 가리키는 값 :", array2d[1,0])
print("(row=2, col=2) index 가리키는 값 :", array2d[2,2])

[[1 2 3]
 [4 5 6]
 [7 8 9]]
(row=0, col=0) index 가리키는 값 : 1
(row=0, col=1) index 가리키는 값 : 2
(row=1, col=0) index 가리키는 값 : 4
(row=2, col=2) index 가리키는 값 : 9

axis 0 : 로우 방향의 축  
axis 1 : 칼럼 방향의 축  
[row=0,col=1] = [axis 0=0, axis1=1]

In [20]:
# 슬라이싱

array1=np.arange(start=1,stop=10)
array3=array1[0:3]
print(array3)
print(type(array3))

[1 2 3]
<class 'numpy.ndarray'>

: 기호 앞에 시작 인덱스를 생략 -> 맨 처음 인덱스인 0으로 간주  
: 기호 뒤에 종료 인덱스 생략 -> 맨 마지막 인덱스로 간주  
: 기호 앞/뒤 에 시작/종료 인덱스 생략 -> 자동으로 맨 처음/맨 마지막 인덱스로 간주

In [21]:
array1=np.arange(start=1,stop=10)

# : 앞 시작 인덱스 생략 -> 맨 처음 인덱스
array4=array1[:3]
print(array4)

# : 뒤 종료 인덱스 생략 -> 맨 마지막 인덱스
array5=array1[3:]
print(array5)

# : 앞/뒤 종료 인덱스 생략 -> 맨 처음/ 마지막 인덱스
array6=array1[:]
print(array6)

[1 2 3]
[4 5 6 7 8 9]
[1 2 3 4 5 6 7 8 9]

In [22]:
#2차원 ndarray에서 슬라이싱

array1d=np.arange(start=1, stop=10)
array2d=array1d.reshape(3,3)
print("array2d:\n", array2d)

print("array2d[0:2, 0:2]\n", array2d[0:2,0:2])
print("array2d[1:3, 0:3]\n", array2d[1:3,0:3])
print("array2d[1:3, :]\n", array2d[1:3, :])
print("array2d[: , :]\n", array2d[: ,:])
print("array2d[:2, :1]\n", array2d[:2,:1])
print("array2d[:2,0]\n", array2d[:2,0])

array2d:
 [[1 2 3]
 [4 5 6]
 [7 8 9]]
array2d[0:2, 0:2]
 [[1 2]
 [4 5]]
array2d[1:3, 0:3]
 [[4 5 6]
 [7 8 9]]
array2d[1:3, :]
 [[4 5 6]
 [7 8 9]]
array2d[: , :]
 [[1 2 3]
 [4 5 6]
 [7 8 9]]
array2d[:2, :1]
 [[1]
 [4]]
array2d[:2,0]
 [1 4]

In [23]:
#2차원 ndarray에서 뒤에 오는 인덱스가 없으면 1차원 ndarray 반환
print(array2d[0])
print(array2d[1])
print("array2d[0] shape :", array2d[0].shape, "array2d[1] :", array2d[1].shape)

[1 2 3]
[4 5 6]
array2d[0] shape : (3,) array2d[1] : (3,)

In [24]:
#팬시 인덱싱

array1d=np.arange(start=1, stop=10)
array2d=array1d.reshape(3,3)

array3=array2d[[0,1],2]
print("array2d[[0,1],2] ->",array3d.tolist())

array4d=array2d[[0,1],0:2]
print("array2d[[0,1],0:2] -> ", array4d.tolist())

array5d=array2d[[0,1]]
print("array5d[[0,1]] ->", array5d.tolist())

array2d[[0,1],2] -> [[[0, 1], [2, 3]], [[4, 5], [6, 7]]]
array2d[[0,1],0:2] ->  [[1, 2], [4, 5]]
array5d[[0,1]] -> [[1, 2, 3], [4, 5, 6]]

In [25]:
#불린 인덱싱

array1d=np.arange(start=1, stop=10)
#[] 안에 array1d > 5 Boolean indexing을 적용
array3=array1d[array1d>5]
print("array1d>5 불린 인덱싱 결과 값 :", array3)

array1d>5 불린 인덱싱 결과 값 : [6 7 8 9]

In [26]:
#넘파이 ndarray 객체에 조건식 할당하여 []안에 기재
array1d>5

array([False, False, False, False, False,  True,  True,  True,  True])

In [27]:
# True 값이 있는 위치 인덱스 값으로 자동 변환하여 반환

boolean_indexes=np.array([False, False, False, False, False,  True,  True,  True,  True])
array3=array1d[boolean_indexes]
print("불린 인덱스로 필터링 결과 :",array3)

불린 인덱스로 필터링 결과 : [6 7 8 9]

In [28]:
indexes=np.array([5,6,7,8])
array4=array1d[indexes]
print("일반 인덱스로 필터링 결과 :", array4 )

일반 인덱스로 필터링 결과 : [6 7 8 9]

# 행렬의 정렬 - sort()와 argsort()
행렬을 정렬하는 대표적인 방법 : np.sort()와 ndarray.sort()  
정렬된 행렬의 인덱스를 반환 : argsort()

## 행렬 정렬
np.sort() : 넘파이에서 sort()를 호출, 원 행렬은 그대로 유지한 채 원 행렬의 정렬된 행렬 반환  
ndarray.sort() : 행렬 자체에서 sort()를 호출, 원 행렬 자체를 정렬한 형태로 변환하며 반환 값은 None

In [29]:
org_array=np.array([3,1,9,5])
print("원본 행렬 :", org_array)
#np.sort()로 정렬
sort_array1=np.sort(org_array)
print("np.sort() 호출 후 반환된 정렬 행렬 :", sort_array1)
print("np.sort() 호출 후 원본 행렬 :", org_array)
#ndarray.sort()로 정렬
sort_array2=org_array.sort()
print("ort_array.sort() 호출 후 반환된 행렬 :", sort_array2)
print("ort_array.sort() 호출 후 원본 행렬 :", org_array)

원본 행렬 : [3 1 9 5]
np.sort() 호출 후 반환된 정렬 행렬 : [1 3 5 9]
np.sort() 호출 후 원본 행렬 : [3 1 9 5]
ort_array.sort() 호출 후 반환된 행렬 : None
ort_array.sort() 호출 후 원본 행렬 : [1 3 5 9]

In [30]:
#내림차순으로 정렬
sort_array1_desc=np.sort(org_array)[::-1]
print("내림차순으로 정렬:", sort_array1_desc)

내림차순으로 정렬: [9 5 3 1]

In [31]:
#2차원 이상인 행렬에서의 정렬
array2d=np.array([[8,12],
                 [7,1]])
sort_array2d_axis0=np.sort(array2d,axis=0)
print("로우 방향으로 정렬 :\n",sort_array2d_axis0)

sort_array2d_axis1=np.sort(array2d,axis=1)
print("칼럼 방향으로 정렬 :\n", sort_array2d_axis1)

로우 방향으로 정렬 :
 [[ 7  1]
 [ 8 12]]
칼럼 방향으로 정렬 :
 [[ 8 12]
 [ 1  7]]

In [32]:
# 정렬된 행렬의 인덱스 반환

org_array=np.array([3,1,9,5])
sort_indices=np.argsort(org_array)
print(type(sort_indices))
print("행렬 정렬 시 원본 행렬의 인덱스 :", sort_indices)

<class 'numpy.ndarray'>
행렬 정렬 시 원본 행렬의 인덱스 : [1 0 3 2]

In [33]:
#내림차순으로 정렬 시 원본 행렬의 인덱스

org_array=np.array([3,1,9,5])
sort_indices_desc=np.argsort(org_array)[::-1]
print("행렬 내림차순 정렬 시 원본 행렬의 인덱스 :", sort_indices_desc)

행렬 내림차순 정렬 시 원본 행렬의 인덱스 : [2 3 0 1]

argsort()는 넘파이에서 높은 활용도를 보인다.  
실제 값과 그 값이 뜻하는 메타 데이터를 별도의 ndarray로 각각 가져야 한다. np.argosrt()로 반환된 인덱스를 팬시 인덱스로 적용해 추출 가능

In [34]:
import numpy as np

name_array=np.array(['John','Mike', 'Sarah', 'Kate', 'Samuel'])
score_array=np.array([78,95,84,98,88])

sort_indices_asc=np.argsort(score_array)
print("성적 오름차순 정렬 시 score_array의 인덱스 :", sort_indices_asc)
print(" 성적 오름차순으로 name_array의 이름 출력 :", name_array[sort_indices_asc])

성적 오름차순 정렬 시 score_array의 인덱스 : [0 2 4 1 3]
 성적 오름차순으로 name_array의 이름 출력 : ['John' 'Sarah' 'Samuel' 'Mike' 'Kate']

# 선형대수 연산 - 행렬 내적과 전치 행렬 구하기

행렬 내적(행렬 곱)  
np.dot()을 이용해 계산 가능 np.dot(A,B)

In [35]:
A=np.array([[1,2,3],
           [4,5,6]])
B=np.array([[7,8],
           [9,10],
           [11,12]])

dot_product=np.dot(A,B)
print("행렬 내적 결과 :\n", dot_product)

행렬 내적 결과 :
 [[ 58  64]
 [139 154]]

전치 행렬  
원 행렬에서 행과 열 위치를 교환한 원소로 구성한 행렬

In [36]:
A=np.array([[1,2],
           [3,4]])

transpose_mat=np.transpose(A)
print("A의 전치 행렬 :\n", transpose_mat)

A의 전치 행렬 :
 [[1 3]
 [2 4]]

# 판다스 - 파일을 DataFrame으로 로딩, 기본 API

In [37]:
import pandas as pd

In [38]:
# DataFrame으로 로딩
titanic_df=pd.read_csv(r"C:\Users\songs\Downloads\titanic_train.csv")
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [39]:
print("titanic 변수 type :", type(titanic_df))
titanic_df

titanic 변수 type : <class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [40]:
#DataFrame의 행과 열 크기
print("DataFrame 크기 :", titanic_df.shape)

DataFrame 크기 : (891, 12)

In [41]:
#info() : 총 데이터 건수와 데이터 타입, Null 건수
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [42]:
# describe() : 분포도, 평균값, 최댓값, 최솟값
# 오직 숫자형 칼럼의 분포도만 조사

titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [43]:
# Pclass 칼럼의 값의 분포 구성

value_counts=titanic_df['Pclass'].value_counts()
print(value_counts)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [44]:
# 해당 칼럼에 해당하는 Series 객체 반환
titanic_pclass=titanic_df['Pclass']
print(type(titanic_pclass))

<class 'pandas.core.series.Series'>

In [45]:
titanic_pclass.head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [46]:
# Null 값을 포함하여 value_counts() 적용

print("titanic_df 데이터 건수 :", titanic_df.shape[0])
print("기본 성절인 dropna=True로 value_counts()")
# value_counts는 디폴트로 dropna=True이므로 value_counts(dropna=False)와 동일
print(titanic_df['Embarked'].value_counts())
print(titanic_df['Embarked'].value_counts(dropna=False))

titanic_df 데이터 건수 : 891
기본 성절인 dropna=True로 value_counts()
S    644
C    168
Q     77
Name: Embarked, dtype: int64
S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

# DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 상호 변환

In [47]:
import numpy as np

In [48]:
#1차원 형태의 데이터를 기반으로 DataFrame 생성

col_name1=['col1']
list1=[1,2,3]
array1=np.array(list1)
print("array1 shape :", array1.shape)
#리스트를 이용해 DataFrame 생성
df_list1=pd.DataFrame(list1, columns=col_name1)
print("1차원 리스트로 만든 DataFrame :\n", df_list1)
#넘파이 ndarray를 이용해 DataFrame 생성
df_array1=pd.DataFrame(array1, columns=col_name1)
print("1차원 ndarray로 만든 DataFrame : \n", df_array1)

array1 shape : (3,)
1차원 리스트로 만든 DataFrame :
    col1
0     1
1     2
2     3
1차원 ndarray로 만든 DataFrame :
    col1
0     1
1     2
2     3

In [49]:
# 2차원 형태의 데이터를 기반으로 DataFrame 생성

# 3개의 칼럼명이 필요
col_name2=['col1','col2','col3']

# 2행 x 3열 형태의 리스트와 ndarray 생성한 뒤 이를 DataFrame으로 변환
list2=[[1,2,3],
      [11,12,13]]
array2=np.array(list2)
print("array2 shape :", array2.shape)
df_list2=pd.DataFrame(list2, columns=col_name2)
print("2차원 리스트로 만든 DataFrame :\n", df_list2)
df_array2=pd.DataFrame(array2,columns=col_name2)
print("2차원 ndarray로 만든 DataFrame:\n", df_array2)

array2 shape : (2, 3)
2차원 리스트로 만든 DataFrame :
    col1  col2  col3
0     1     2     3
1    11    12    13
2차원 ndarray로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

In [50]:
# 딕셔너리를 DataFrame으로 변환

#Key는 문자열 칼럼명으로 매핑, Value는 리스트 형(또는 ndarray) 칼럼 데이터로 매핑
dict={'col1' :[1,11], 'col2':[2,12],'col3' :[3,13]}
df_dict=pd.DataFrame(dict)
print("딕셔너리로 만든 DataFrame :\n", df_dict)

딕셔너리로 만든 DataFrame :
    col1  col2  col3
0     1     2     3
1    11    12    13

In [51]:
#DataFrame을 ndarray로 변환
array3=df_dict.values
print("df_dict.values 타입 :", type(array3), "df_dict.values shape :", array3.shape)
print(array3)

df_dict.values 타입 : <class 'numpy.ndarray'> df_dict.values shape : (2, 3)
[[ 1  2  3]
 [11 12 13]]

In [52]:
#DataFrame을 리스트로 변환
list3=df_dict.values.tolist()
print("df_dict.values.tolist() 타입 :", type(list3))
print(list3)

#DataFrame을 딕셔너리로 변환
dict3=df_dict.to_dict('list')
print("\n df_dict.to_dict() 타입 :", type(dict3))
print(dict3)

df_dict.values.tolist() 타입 : <class 'list'>
[[1, 2, 3], [11, 12, 13]]

 df_dict.to_dict() 타입 : <class 'dict'>
{'col1': [1, 11], 'col2': [2, 12], 'col3': [3, 13]}

# DataFrame의 칼럼 데이터 세트 생성과 수정

In [53]:
# 칼럼 추가
titanic_df['Age_0']=0
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [54]:
# 기존 칼럼 Series의 데이터를 이용해 새로운 칼럼 생성

titanic_df['Age_by_10']=titanic_df['Age']*10
titanic_df['Family_No']=titanic_df['SibSp']+titanic_df['Parch']+1
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

In [55]:
# 기존 칼럼 값 업데이트

titanic_df['Age_by_10']=titanic_df['Age_by_10']+100
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

# DataFrame 데이터 삭제

In [56]:
titanic_drop_df=titanic_df.drop('Age_0', axis=1)
titanic_drop_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,360.0,1

In [57]:
drop_results=titanic_df.drop(['Age_0','Age_by_10','Family_No'],axis=1, inplace=True)
print("inplace=True로 drop 후 변환된 값 :", drop_results)
titanic_df.head(3)

inplace=True로 drop 후 변환된 값 : None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [58]:
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)
print("### before axis 0 drop ###")
print(titanic_df.head(3))

titanic_df.drop([0,1,2], axis=0, inplace=True)

print("### after axis 0 drop ###" )
print(titanic_df.head(3))

### before axis 0 drop ###
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
### after axis 0 drop ###
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q

# Index 객체

In [59]:
#원본 파일 다시 로딩
titanic_df=pd.read_csv(r"C:\Users\songs\Downloads\titanic_train.csv")
# Index 객체 추출
indexes=titanic_df.index
print(indexes)
#Index 객체를 실제 값 array로 변환
print("Index 객체 array 값: \n", indexes.values)

RangeIndex(start=0, stop=891, step=1)
Index 객체 array 값:
 [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [60]:
# 단일 값 반환 및 슬라이싱
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

In [61]:
# 한 번 만들어진 DataFrame 및 Series의 Index 객체는 변경 불가
indexes[0]=5

TypeError: Index does not support mutable operations

In [ ]:
series_fair=titanic_df['Fare']
print('Fair Series max 값 :', series_fair.max())
print('Fair Series sum 값 :', series_fair.sum())
print('sum () Fair Series :', sum(series_fair))
print('Fair Series + 3 \n' , (series_fair+3).head(3))

In [62]:
# reset_index() : 새롭게 인덱스를 연속 숫자 형으로 할당, 기존 인덱스는 'index'라는 새로운 칼럼명으로 추가

titanic_reset_df=titanic_df.reset_index(inplace=False)
titanic_reset_df.head(3)

   index  PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0      0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1      1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2      2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [63]:
# 인덱스가 연속된 int 숫자형 데이터가 아닐 경우, 다시 연속 int 숫자형 데이터로 만들 때

print("### before reset_index ###")
value_counts=titanic_df['Pclass'].value_counts()
print(value_counts)
print('value_counts 객체 변수 타입 :', type(value_counts))
new_value_counts=value_counts.reset_index(inplace=False)
print("### After reset_index ###")
print(new_value_counts)
print("new_value_counts 객체 변수 타입 :", type(new_value_counts))

### before reset_index ###
3    491
1    216
2    184
Name: Pclass, dtype: int64
value_counts 객체 변수 타입 : <class 'pandas.core.series.Series'>
### After reset_index ###
   index  Pclass
0      3     491
1      1     216
2      2     184
new_value_counts 객체 변수 타입 : <class 'pandas.core.frame.DataFrame'>

In [64]:
# reset_index() 매개 변수 중 drop=True로 설정하면 기존 인덱스는 삭제
new_value_counts1=value_counts.reset_index(inplace=False, drop=True)
print(new_value_counts1)

0    491
1    216
2    184
Name: Pclass, dtype: int64

# 데이터 셀렉션 및 필터링

In [65]:
# DataFrame 바로 뒤 [] 안에는 칼럼명 문자

print("단일 칼럼 데이터 추출 :\n", titanic_df['Pclass'].head(3))
print("\n여러 칼럼의 데이터 추출 :\n", titanic_df[['Survived'],['Pclass']].head(3))
print('[] 안에 숫자 index는 KeyError 오류 발생 :\n', titanic_df[0])

단일 칼럼 데이터 추출 :
 0    3
1    1
2    3
Name: Pclass, dtype: int64

InvalidIndexError: (['Survived'], ['Pclass'])

In [ ]:
# 슬라이싱 연산으로 데이터를 추출하는 방법은 가능하나, 사용하지 않는 것이 좋다.
titanic_df[0:2]

In [ ]:
# [] 내에 불린 인덱싱 표현 가능
titanic_df[titanic_df['Pclass']==3].head(3)

In [66]:
# DataFrame iloc[] 연산자
# iloc[] : 위치 기반 인덱싱 방식

data={'Name':['Chulmin','Eunkyung','Jinwoong','Soobeom'],
     'Year':[2011,2016,2015,2015],
     'Gender':['Male','Female','Male','Male']}
data_df=pd.DataFrame(data, index=['one','two','three','four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [67]:
data_df.iloc[0,0]

'Chulmin'

In [68]:
# 좌표 정숫값 형태로 입력하지 않으면 오류 발생
data_df.iloc[0,'Name']

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [ ]:
print("\n 맨 마지막 컬럼 데이터 [:,-1] \n", data_df.iloc[:,-1])
print("\n 맨 마지막 컬럼을 제외한 모든 데이터[:,:-1]\n", data_df.iloc[:,:-1])

In [69]:
# DataFrame loc[] 인자
# loc[] : 명칭 기반 인덱싱 방식

data_df.loc['one','Name']

'Chulmin'

In [70]:
# 다음 코드는 오류를 발생시킵니다.
data_df.loc[0,'Name']

KeyError: 0

In [ ]:
# loc[] 슬라이싱에서는 시작 값부터 종료 값까지 포함해서 의미

print("위치 기반 iloc slicing\n", data_df.iloc[0:1,0],"\n")
print("명칭 기반 loc slicing\n", data_df.loc["one":"two", "Name"])

In [ ]:
# 불린 인덱싱 : []와 loc[]에서 지원

titanic_df=pd.read_csv(r"C:\Users\songs\Downloads\titanic_train.csv")
titanic_boolean=titanic_df[titanic_df['Age']>60]
print(type(titanic_boolean))
titanic_boolean

In [ ]:
titanic_df[titanic_df['Age']>60][['Name','Age']].head(3)

In [71]:
# loc[]에서는 칼럼명을 칼럼 위치에 둔다.
titanic_df.loc[titanic_df['Age']>60, ['Name','Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [72]:
#복합 조건에서 인덱싱

titanic_df[(titanic_df['Age']>60) &(titanic_df['Pclass']==1) & (titanic_df['Sex']=='female')]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

In [73]:
cond1=titanic_df['Age']>60
cond2=titanic_df['Pclass']==1
cond3=titanic_df['Sex']=='female'

titanic_df[cond1&cond2&cond3]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

# 행렬, Aggregation 함수, Groupby 적용

In [74]:
# DataFrame, Series의 정렬 - sort_values()
titanic_sorted=titanic_df.sort_values(by=['Name'])
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket   Fare Cabin Embarked
845          846         0       3  Abbing, Mr....    male  42.0      0      0  C.A. 5547   7.55   NaN        S
746          747         0       3  Abbott, Mr....    male  16.0      1      1  C.A. 2673  20.25   NaN        S
279          280         1       3  Abbott, Mrs...  female  35.0      1      1  C.A. 2673  20.25   NaN        S

In [75]:
titanic_sorted=titanic_df.sort_values(by=['Pclass','Name'], ascending=False)
titanic_sorted

     PassengerId  Survived  Pclass            Name     Sex    Age  SibSp  Parch    Ticket      Fare    Cabin Embarked
868          869         0       3  van Melkebe...    male    NaN      0      0    345777    9.5000      NaN        S
153          154         0       3  van Billiar...    male  40.50      0      2  A/5. 851   14.5000      NaN        S
282          283         0       3  de Pelsmaek...    male  16.00      0      0    345778    9.5000      NaN        S
286          287         1       3  de Mulder, ...    male  30.00      0      0    345774    9.5000      NaN        S
559          560         1       3  de Messemae...  female  36.00      1      0    345572   17.4000      NaN        S
..           ...       ...     ...             ...     ...    ...    ...    ...       ...       ...      ...      ...
460          461         1       1  Anderson, M...    male  48.00      0      0     19952   26.5500      E12        S
498          499         0       1  Allison, Mr...  female  25.00      1      2    113781  151.5500  C22 C26        S
297          298         0       1  Allison, Mi...  female   2.00      1      2    113781  151.5500  C22 C26        S
305          306         1       1  Allison, Ma...    male   0.92      1      2    113781  151.5500  C22 C26        S
730          731         1       1  Allen, Miss...  female  29.00      0      0     24160  211.3375       B5        S

[891 rows x 12 columns]

In [76]:
# Aggregation 함수 적용

#titanic_df의 모든 칼럼에 count() 결과 반환
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [77]:
# 특정 칼럼만 추출해 aggregation
titanic_df[['Age','Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

In [78]:
# groupby() 적용

titanic_groupby=titanic_df.groupby(by='Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [79]:
# groupby()를 호출해 반환된 결과에 aggregation 함수 호출 -> groupby() 대상 칼럼을 제외한 칼럼에 aggregation 함수 적용

titanic_groupby=titanic_df.groupby('Pclass').count()
titanic_groupby

        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1               216       216   216  216  186    216    216     216   216    176       214
2               184       184   184  184  173    184    184     184   184     16       184
3               491       491   491  491  355    491    491     491   491     12       491

In [80]:
# 특정 칼럼을 aggregation 하려면 groupby()로 변환된 객체에 해당 칼럼을 필터링한 뒤 aggregation 함수 적용

titanic_groupby=titanic_df.groupby('Pclass')[['PassengerId','Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [81]:
#여러 개의 aggregation 함수명을 agg() 내에 인자로 입력하여 사용

titanic_df.groupby('Pclass')['Age'].agg([max,min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [82]:
# 여러 개의 칼럼이 서로 다른 aggregation을 수행해야 하는 경우

agg_format={'Age':'max', 'SibSp' :'sum', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

# 결손 데이터 처리하기

In [83]:
# isna()로 결손 데이터 여부 확인
titanic_df.isna().head(3)

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket   Fare  Cabin  Embarked
0        False     False   False  False  False  False  False  False   False  False   True     False
1        False     False   False  False  False  False  False  False   False  False  False     False
2        False     False   False  False  False  False  False  False   False  False   True     False

In [84]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [85]:
# fillna()로 결손 데이터 처리하기

titanic_df['Cabin']=titanic_df['Cabin'].fillna('C000')
# inplace=True 파라미터를 추가해야 실제 데이터 세트 값 변경
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500  C000        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250  C000        S

In [86]:
titanic_df['Age']=titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked']=titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

# apply lambda 식으로 데이터 가공

In [87]:
def get_square(a) :
    return a**2

print("3의 제곱은 :", get_square(3))

3의 제곱은 : 9

In [88]:
#위의 get_square()를 lambda식으로 변환
lambda_square=lambda x :x**2
print("3의 제곱은 :", lambda_square(3))

3의 제곱은 : 9

In [89]:
a=[1,2,3]
squares=map(lambda x : x**2, a)
list(squares)

[1, 4, 9]

In [90]:
titanic_df['Name_len']=titanic_df['Name'].apply(lambda x : len(x))
titanic_df[['Name','Name_len']].head(3)

             Name  Name_len
0  Braund, Mr....        23
1  Cumings, Mr...        51
2  Heikkinen, ...        22

In [92]:
#나이에 따라 Child와 Adult로 분류

titanic_df['Child_Adult']=titanic_df['Age'].apply(lambda x : 'Child' if x <=15 else 'Adult')
titanic_df[['Age','Child_Adult']].head(8)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child

In [93]:
titanic_df['Age_cat']=titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else('Adult' if x<60 else 'Elderly'))

titanic_df['Age_cat'].value_counts()

Adult      782
Child       83
Elderly     26
Name: Age_cat, dtype: int64

In [94]:
#나이에 따라 세분화된 분류를 수행하는 함수 생성
def get_category(age):
    cat=''
    if age<=5:cat='Baby'
    elif age<=12 : cat='Child'
    elif age<=18: cat='Teenager'
    elif age<=25: cat='Student'
    elif age<=35 : cat='Young Adult'
    elif age<=60 : cat= 'Adult'
    else : cat= 'Elderly'
        
    return cat

# lambda 식에 위에서 생성한 get_category() 함수를 반환값으로 지정
# get_Category(X)는 입력값으로 'Age' 칼럼 값을 받아서 해당하는 cat 반환
titanic_df['Age_cat']=titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age','Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult